Autodesk.Revit.DB.FamilySource
Describes which version of the family to be loaded.

Autodesk.Revit.DB.FamilySource.Family
Loading the family from current family document.

Autodesk.Revit.DB.FamilySource.Project
Loading the family from target project document.